<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Ответы на вопросы</title>
</head>
<body>
	<h1>Ответы на вопросы</h1>
	<p> Объяснить, как работает данный код: <br><br>
			<b>$a = 5; </b>- Задали переменную, по умолчанию она целое число <br>
			<b>$b = '05';</b> - Задали переменную, по умолчанию она строковая, но может быть воспринята как число при нестрогом сравнении или в расчетах<br>
			<b>var_dump($a == $b);         // Почему true?</b> - Нестрогое сравнение, если есть возможность - данные приводятя к сравнимому типу данных. <br>
			<b>var_dump((int)'012345');     // Почему 12345?</b> - INT тип данных для целых чисел, ноль в начале отбрасывается<br>
			<b>var_dump((float)123.0 === (int)123.0); // Почему false?</b> - Строго сравниваем дробное число с целым числом, у которого отбрасывается дробная часть - результат - не совпадает.<br>
			<b>var_dump((int)0 === (int)'hello, world'); // Почему true? </b>- Второе значение не может оставаться строкой, переводится в доступное число, и оно 0. Сравнение оказывается верным. Проверим, выведя содержимое второго выражения ниже: <br>
		</p>
		<?php
		$test = (int)'hello, world';
		var_dump($test);
		?> 

</body>
</html>
